[
  {
    "startTime": "09:00",
    "duration": "08:00",
    "topic": "Animated Interfaces with Vue.js",
    "type": "talk",
    "img": "https://cfp.connectevents.io/system/avatars/1151/large/97cssCek_400x400.jpg?1513436066",
    "author": "Sarah Drasner",
    "authorInfo": "Sarah Drasner is an award-winning Speaker, Senior Developer Advocate at Microsoft, and Staff Writer at CSS-Tricks. Sarah is also the co-founder of Web Animation Workshops, with Val Head. She’s the author of SVG Animations from O’Reilly and has given Frontend Masters workshops on Vue.js and Advanced SVG Animations. Sarah is formerly Manager of UX Design & Engineering at Trulia (Zillow).",
    "description": "",
    "social": [
      {
        "twitter": "https://twitter.com/@sarah_edo"
      }
    ]
  },
  {
    "startTime": "09:00",
    "duration": "08:00",
    "topic": "(SOLD OUT) Advanced Features from the Ground Up",
    "type": "talk",
    "img": "https://cfp.connectevents.io/system/avatars/1107/large/499550.jpeg?1515104079",
    "author": "Evan You",
    "authorInfo": "Creator of Vue.js ",
    "description": "Advanced Features from the Ground Up",
    "social": [
      {
        "twitter": "https://twitter.com/youyuxi"
      }
    ]
  },
  {
    "startTime": "09:00",
    "duration": "08:00",
    "topic": "Proven patterns for building Vue apps",
    "type": "talk",
    "img": "https://cfp.connectevents.io/system/avatars/978/large/rMSXLIWW_400x400.jpg?1515104982",
    "author": "Chris Fritz",
    "authorInfo": "Educator/hacker working to make web dev simpler. Vue core team member and curator of our docs.",
    "description": "In this workshop, we'll cover everything you need to know to get started building world-class Vue applications. Topics will include configuring Webpack for single-file components, setting up the most advanced workflows currently possible, how to organize (and reorganize) increasingly complex applications, and more.",
    "social": [
      {
        "twitter": "https://twitter.com/chrisvfritz"
      }
    ]
  },
  {
    "startTime": "09:00",
    "duration": "08:00",
    "topic": "Application state with Vuex",
    "type": "talk",
    "img": "https://cfp.connectevents.io/system/avatars/1159/large/blake.jpg?1515449951",
    "author": "Blake Newman",
    "authorInfo": "Frontend Engineer, Speaker and @vuejs core team member. Ensuring maintainable, modular and performance code based on Sacrificial Architecture principles.\r\n\r\n",
    "description": "In Vue.js is quite simple to work with components, and share data among them using events and props - especially in small to medium projects. When an application starts growing, managing components state might become tedious and overwhelming. This is where Vuex comes to our rescue. Vuex is a state management pattern and official library for Vue.js applications. It serves as a centralized store for all the components in an application, with rules ensuring that the state can only be mutated in a predictable fashion. By the end of the workshop, attendees will be able to develop elegant, debuggable, maintainable, and organized applications using a centralized store. No prior experience with Vuex is needed. We will answer the common question “When should I use Vuex?” and work on real-world features.",
    "social": [
      {
        "twitter": "https://twitter.com/"
      }
    ]
  },
  {
    "startTime": "18:00",
    "duration": "02:00",
    "topic": "Happy Hour at the House of Blues",
    "type": "other",
    "img": "/img/ic-happy.svg"
  }
]